{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["decoder_dense", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "encoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 53], "name": "encoder_inputs", "sparse": false}}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional", "config": {"trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "kernel_regularizer": null, "stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "return_state": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 256, "implementation": 1, "recurrent_constraint": null, "activity_regularizer": null, "name": "encoder_lstm", "unroll": false, "dropout": 0.0, "kernel_constraint": null, "return_sequences": false, "activation": "tanh", "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null}}, "name": "bidirectional_1"}}, {"inbound_nodes": [], "name": "decoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 55], "name": "decoder_inputs", "sparse": false}}, {"inbound_nodes": [[["bidirectional_1", 0, 1, {}], ["bidirectional_1", 0, 3, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"inbound_nodes": [[["bidirectional_1", 0, 2, {}], ["bidirectional_1", 0, 4, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["concatenate_1", 0, 0, {}], ["concatenate_2", 0, 0, {}]]], "name": "decoder_lstm", "class_name": "LSTM", "config": {"go_backwards": false, "kernel_regularizer": null, "stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "return_state": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 512, "implementation": 1, "recurrent_constraint": null, "activity_regularizer": null, "name": "decoder_lstm", "unroll": false, "dropout": 0.0, "kernel_constraint": null, "return_sequences": true, "activation": "tanh", "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null}}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "name": "decoder_dense", "class_name": "Dense", "config": {"activity_regularizer": null, "name": "decoder_dense", "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 55, "bias_regularizer": null}}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}}