{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"output_layers": [["decoder_dense", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "encoder_inputs", "config": {"batch_input_shape": [null, null, 100], "sparse": false, "dtype": "float32", "name": "encoder_inputs"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "decoder_inputs", "config": {"batch_input_shape": [null, null, 100], "sparse": false, "dtype": "float32", "name": "decoder_inputs"}}, {"class_name": "LSTM", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "name": "encoder_lstm", "config": {"return_state": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "trainable": true, "name": "encoder_lstm", "dropout": 0.0, "kernel_regularizer": null, "activation": "tanh", "stateful": false, "return_sequences": false, "unroll": false, "implementation": 1, "use_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": false, "units": 256, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "LSTM", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "name": "decoder_lstm", "config": {"return_state": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "trainable": true, "name": "decoder_lstm", "dropout": 0.0, "kernel_regularizer": null, "activation": "tanh", "stateful": false, "return_sequences": true, "unroll": false, "implementation": 1, "use_bias": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": false, "units": 256, "unit_forget_bias": true, "kernel_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "name": "decoder_dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "name": "decoder_dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activation": "softmax", "units": 3648, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "name": "model_1"}}